import math

def expression(x):
    if x <= 0:
        print("x не може бути меншим або дорівнювати нулю")
    else:
        z = (2 * math.tan(x) + math.sqrt(x)) / x
        return z

def sum(x, y):

    sum = 0

    for i in range (x, y + 1):

        if i % 3 == 0:

            sum += i

    return sum

x = int(input("Введіть значення x для обчислення виразу z: "))

print ("Значення виразу z = ", expression(x))

x = int(input("Введіть від якого числа (х) знаходити суму усіх чисел, кратних 3: "))

y = int(input("Введіть до якого числа (y) знаходити суму усіх  чисел, кратних 3: "))

while x > y:

    x = int(input("у не може бути менше х, введіть ще раз від якого числа (х) знаходити суму усіх  чисел, кратних 3: "))

    y = int(input("Введіть до якого числа (y) знаходити суму усіх  чисел, кратних 3: "))

print("Сума  чисел, кратних 3, від х до у = ", sum(x, y))